In [12]:
import pandas as pd
import numpy as np

ext2 = pd.read_csv('Датасет\\db2\\Ext2.csv')
ext1 = pd.read_csv('Датасет\\db2\\Ext.csv')
catch = pd.read_csv('Датасет\\db1\\catch.csv') 
product = pd.read_csv('Датасет\\db1\\product.csv')

In [6]:
test_id = catch.id_own.iloc[0]

In [23]:
catch[(catch.id_own == test_id) & (catch.date.str.contains('2022-04-20'))]

,id_ves,date,id_region,id_fish,catch_volume,id_regime,permit,id_own
84248,2024908,2022-04-20,274,400,10.442,1,2351477,7115834
84249,2024908,2022-04-20,274,403,14.093,1,2351477,7115834
84250,2024908,2022-04-20,274,451,14.692,1,2351477,7115834
84251,2024908,2022-04-20,274,457,0.209,97,2351477,7115834
84252,3965387,2022-04-20,273,849,4.573,1,4877462,7115834
84296,8270286,2022-04-20,267,692,30.299,1,3454942,7115834
84309,2701764,2022-04-20,274,400,10.531,1,5925461,7115834
84310,2701764,2022-04-20,274,403,13.642,1,5925461,7115834
84311,2701764,2022-04-20,274,451,15.276,1,5925461,7115834

In [24]:
ext1[(ext1.id_own == test_id) & (ext1.date_fishery.str.contains('2022-04-20'))]

,id_fishery,id_own,date_fishery,numPart,id_Plat,id_vsd,Name_Plat,Product_period,Region_Plat
16689,7244716,7115834,2022-04-20 00:00:00,\N,7127846,326315,\N,\N,\N
16690,7244716,7115834,2022-04-20 00:00:00,\N,7127846,3527650,\N,\N,\N
16691,7244716,7115834,2022-04-20 00:00:00,\N,7127846,2233380,\N,\N,\N
16692,7244716,7115834,2022-04-20 00:00:00,\N,7127846,2912231,\N,\N,\N
16693,5868605,7115834,2022-04-20 00:00:00,\N,2403603,9466358,\N,\N,\N
16694,3487610,7115834,2022-04-20 00:00:00,\N,4899079,401394,\N,\N,\N
16729,867437,7115834,2022-04-20 00:00:00,\N,6996629,3734122,\N,\N,\N
16730,867437,7115834,2022-04-20 00:00:00,\N,6996629,4000204,\N,\N,\N
16731,867437,7115834,2022-04-20 00:00:00,\N,6996629,3338879,\N,\N,\N

In [20]:
ext1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3260798 entries, 0 to 3260797
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   id_fishery      int64
 1   id_own          int64
 2   date_fishery    object
 3   numPart         object
 4   id_Plat         int64
 5   id_vsd          int64
 6   Name_Plat       object
 7   Product_period  object
 8   Region_Plat     object
dtypes: int64(4), object(5)
memory usage: 223.9+ MB

In [17]:
test_vsd = ext1[ext1.id_own == test_id].id_vsd.iloc[0]
test_vsd

8482136

In [25]:
ext1[ext1.id_own == test_id]

,id_fishery,id_own,date_fishery,numPart,id_Plat,id_vsd,Name_Plat,Product_period,Region_Plat
9,608483,7115834,2022-05-24 00:00:00,\N,660693,8482136,\N,\N,\N
10,608483,7115834,2022-05-24 00:00:00,\N,660693,8373714,\N,\N,\N
11,608483,7115834,2022-05-24 00:00:00,\N,660693,7280720,\N,\N,\N
12,608483,7115834,2022-05-24 00:00:00,\N,660693,6399168,\N,\N,\N
13,4128905,7115834,2022-05-24 00:00:00,\N,8712885,436652,\N,\N,\N
...,...,...,...,...,...,...,...,...,...
3260475,608483,7115834,2021-01-01 00:00:00,\N,660693,8333076,\N,\N,\N
3260522,4605901,7115834,2020-12-31 00:00:00,\N,7619579,1578396,\N,\N,\N
3260794,3458281,7115834,2020-12-29 00:00:00,\N,906811,6111511,\N,\N,\N
3260795,3458281,7115834,2020-12-29 00:00:00,\N,906811,3138810,\N,\N,\N
3260796,3458281,7115834,2020-12-29 00:00:00,\N,906811,2081767,\N,\N,\N

In [11]:
ext2[ext2.id_vsd == test_vsd]

          id_vsd  num_vsd  id_fish    fish             date_vsd  volume unit
3114848  8482136  1962367      400  минтай  2022-05-24 23:43:01   29756   \N

In [14]:
product[product.id_ves == 4524386].groupby('id_ves').sum()

         id_prod_designate  id_prod_type  prod_volume  prod_board_volume
id_ves
4524386                476       1345203     7886.943          81866.738

In [15]:
product[product.id_ves == 4524386]

,id_ves,date,id_prod_designate,id_prod_type,prod_volume,prod_board_volume
368,4524386,2022-01-01,1,3964,0.161,4.485
369,4524386,2022-01-01,1,3524,18.172,352.446
370,4524386,2022-01-01,1,2606,1.785,29.438
371,4524386,2022-01-01,1,2472,0.437,9.798
3398,4524386,2022-01-02,1,3964,0.598,5.083
...,...,...,...,...,...,...
341714,4524386,2022-04-07,1,1472,0.000,11.109
341715,4524386,2022-04-07,1,2472,0.000,4.922
341716,4524386,2022-04-07,1,2606,0.000,37.068
341717,4524386,2022-04-07,1,3524,0.000,916.570
341718,4524386,2022-04-07,1,3964,0.000,2.576

In [16]:
product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395071 entries, 0 to 395070
Data columns (total 6 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   id_ves             395071 non-null  int64
 1   date               395071 non-null  object
 2   id_prod_designate  395071 non-null  int64
 3   id_prod_type       395071 non-null  int64
 4   prod_volume        395071 non-null  float64
 5   prod_board_volume  395071 non-null  float64
dtypes: float64(2), int64(3), object(1)
memory usage: 18.1+ MB